Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxAsclin_PinMap_TC38x_516.c
/**
 * \file IfxAsclin_PinMap_TC38x_516.c
 * \brief ASCLIN I/O map
 * \ingroup IfxLld_Asclin
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 */

#include "Ifx_Cfg.h"
#if defined (__TASKING__)
#pragma warning 508		/* To suppress empty file warning */
#endif
#if defined (__ghs__)
#pragma diag_suppress 96		/* To suppress empty file warning */
#endif
#if defined DEVICE_TC38X && defined IFX_PIN_PACKAGE_516
#include "IfxAsclin_PinMap_TC38x_516.h" 

IfxAsclin_Cts_In IfxAsclin0_CTSA_P14_9_IN = {&MODULE_ASCLIN0, {&MODULE_P14, 9}, Ifx_RxSel_a};
IfxAsclin_Cts_In IfxAsclin1_CTSA_P20_7_IN = {&MODULE_ASCLIN1, {&MODULE_P20, 7}, Ifx_RxSel_a};
IfxAsclin_Cts_In IfxAsclin1_CTSB_P32_4_IN = {&MODULE_ASCLIN1, {&MODULE_P32, 4}, Ifx_RxSel_b};
IfxAsclin_Cts_In IfxAsclin2_CTSA_P10_7_IN = {&MODULE_ASCLIN2, {&MODULE_P10, 7}, Ifx_RxSel_a};
IfxAsclin_Cts_In IfxAsclin2_CTSB_P33_5_IN = {&MODULE_ASCLIN2, {&MODULE_P33, 5}, Ifx_RxSel_b};
IfxAsclin_Cts_In IfxAsclin3_CTSA_P00_12_IN = {&MODULE_ASCLIN3, {&MODULE_P00,12}, Ifx_RxSel_a};
IfxAsclin_Rts_Out IfxAsclin0_RTS_P14_7_OUT = {&MODULE_ASCLIN0, {&MODULE_P14, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Rts_Out IfxAsclin1_RTS_P20_6_OUT = {&MODULE_ASCLIN1, {&MODULE_P20, 6}, IfxPort_OutputIdx_alt2};
IfxAsclin_Rts_Out IfxAsclin1_RTS_P23_1_OUT = {&MODULE_ASCLIN1, {&MODULE_P23, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Rts_Out IfxAsclin2_RTS_P10_8_OUT = {&MODULE_ASCLIN2, {&MODULE_P10, 8}, IfxPort_OutputIdx_alt2};
IfxAsclin_Rts_Out IfxAsclin2_RTS_P33_4_OUT = {&MODULE_ASCLIN2, {&MODULE_P33, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Rts_Out IfxAsclin3_RTS_P00_9_OUT = {&MODULE_ASCLIN3, {&MODULE_P00, 9}, IfxPort_OutputIdx_alt3};
IfxAsclin_Rx_In IfxAsclin0_RXA_P14_1_IN = {&MODULE_ASCLIN0, {&MODULE_P14, 1}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin0_RXB_P15_3_IN = {&MODULE_ASCLIN0, {&MODULE_P15, 3}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin0_RXC_P01_8_IN = {&MODULE_ASCLIN0, {&MODULE_P01, 8}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin0_RXD_P33_10_IN = {&MODULE_ASCLIN0, {&MODULE_P33,10}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin0_RXE_P13_11_IN = {&MODULE_ASCLIN0, {&MODULE_P13,11}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin10_RXA_P00_4_IN = {&MODULE_ASCLIN10, {&MODULE_P00, 4}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin10_RXB_P00_8_IN = {&MODULE_ASCLIN10, {&MODULE_P00, 8}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin10_RXC_P13_0_IN = {&MODULE_ASCLIN10, {&MODULE_P13, 0}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin10_RXD_P13_1_IN = {&MODULE_ASCLIN10, {&MODULE_P13, 1}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin11_RXA_P10_0_IN = {&MODULE_ASCLIN11, {&MODULE_P10, 0}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin11_RXB_P10_4_IN = {&MODULE_ASCLIN11, {&MODULE_P10, 4}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin11_RXC_P21_0_IN = {&MODULE_ASCLIN11, {&MODULE_P21, 0}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin11_RXD_P21_1_IN = {&MODULE_ASCLIN11, {&MODULE_P21, 1}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin11_RXE_P21_2_IN = {&MODULE_ASCLIN11, {&MODULE_P21, 2}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin11_RXF_P21_5_IN = {&MODULE_ASCLIN11, {&MODULE_P21, 5}, Ifx_RxSel_f};
IfxAsclin_Rx_In IfxAsclin12_RXA_P00_3_IN = {&MODULE_ASCLIN12, {&MODULE_P00, 3}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin12_RXB_P00_5_IN = {&MODULE_ASCLIN12, {&MODULE_P00, 5}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin13_RXA_P00_9_IN = {&MODULE_ASCLIN13, {&MODULE_P00, 9}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin13_RXB_P00_11_IN = {&MODULE_ASCLIN13, {&MODULE_P00,11}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin14_RXA_P33_3_IN = {&MODULE_ASCLIN14, {&MODULE_P33, 3}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin14_RXB_P33_4_IN = {&MODULE_ASCLIN14, {&MODULE_P33, 4}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin15_RXA_P32_4_IN = {&MODULE_ASCLIN15, {&MODULE_P32, 4}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin15_RXB_P32_7_IN = {&MODULE_ASCLIN15, {&MODULE_P32, 7}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin16_RXA_P23_5_IN = {&MODULE_ASCLIN16, {&MODULE_P23, 5}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin16_RXB_P23_7_IN = {&MODULE_ASCLIN16, {&MODULE_P23, 7}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin17_RXA_P22_11_IN = {&MODULE_ASCLIN17, {&MODULE_P22,11}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin17_RXB_P21_0_IN = {&MODULE_ASCLIN17, {&MODULE_P21, 0}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin18_RXA_P21_1_IN = {&MODULE_ASCLIN18, {&MODULE_P21, 1}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin18_RXB_P21_4_IN = {&MODULE_ASCLIN18, {&MODULE_P21, 4}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin19_RXA_P15_6_IN = {&MODULE_ASCLIN19, {&MODULE_P15, 6}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin19_RXB_P15_7_IN = {&MODULE_ASCLIN19, {&MODULE_P15, 7}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin1_RXA_P15_1_IN = {&MODULE_ASCLIN1, {&MODULE_P15, 1}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin1_RXB_P15_5_IN = {&MODULE_ASCLIN1, {&MODULE_P15, 5}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin1_RXC_P20_9_IN = {&MODULE_ASCLIN1, {&MODULE_P20, 9}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin1_RXD_P14_8_IN = {&MODULE_ASCLIN1, {&MODULE_P14, 8}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin1_RXE_P11_10_IN = {&MODULE_ASCLIN1, {&MODULE_P11,10}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin1_RXF_P33_13_IN = {&MODULE_ASCLIN1, {&MODULE_P33,13}, Ifx_RxSel_f};
IfxAsclin_Rx_In IfxAsclin1_RXG_P02_3_IN = {&MODULE_ASCLIN1, {&MODULE_P02, 3}, Ifx_RxSel_g};
IfxAsclin_Rx_In IfxAsclin20_RXA_P14_7_IN = {&MODULE_ASCLIN20, {&MODULE_P14, 7}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin20_RXB_P14_9_IN = {&MODULE_ASCLIN20, {&MODULE_P14, 9}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin21_RXA_P13_0_IN = {&MODULE_ASCLIN21, {&MODULE_P13, 0}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin21_RXB_P13_3_IN = {&MODULE_ASCLIN21, {&MODULE_P13, 3}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin22_RXA_P10_4_IN = {&MODULE_ASCLIN22, {&MODULE_P10, 4}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin22_RXB_P10_5_IN = {&MODULE_ASCLIN22, {&MODULE_P10, 5}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin23_RXA_P10_6_IN = {&MODULE_ASCLIN23, {&MODULE_P10, 6}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin23_RXB_P10_7_IN = {&MODULE_ASCLIN23, {&MODULE_P10, 7}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin2_RXA_P14_3_IN = {&MODULE_ASCLIN2, {&MODULE_P14, 3}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin2_RXB_P02_1_IN = {&MODULE_ASCLIN2, {&MODULE_P02, 1}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin2_RXC_P02_10_IN = {&MODULE_ASCLIN2, {&MODULE_P02,10}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin2_RXD_P10_6_IN = {&MODULE_ASCLIN2, {&MODULE_P10, 6}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin2_RXE_P33_8_IN = {&MODULE_ASCLIN2, {&MODULE_P33, 8}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin2_RXF_P32_6_IN = {&MODULE_ASCLIN2, {&MODULE_P32, 6}, Ifx_RxSel_f};
IfxAsclin_Rx_In IfxAsclin2_RXG_P02_0_IN = {&MODULE_ASCLIN2, {&MODULE_P02, 0}, Ifx_RxSel_g};
IfxAsclin_Rx_In IfxAsclin3_RXA_P15_7_IN = {&MODULE_ASCLIN3, {&MODULE_P15, 7}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin3_RXB_P11_0_IN = {&MODULE_ASCLIN3, {&MODULE_P11, 0}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin3_RXC_P20_3_IN = {&MODULE_ASCLIN3, {&MODULE_P20, 3}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin3_RXD_P32_2_IN = {&MODULE_ASCLIN3, {&MODULE_P32, 2}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin3_RXE_P00_1_IN = {&MODULE_ASCLIN3, {&MODULE_P00, 1}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin3_RXF_P21_6_IN = {&MODULE_ASCLIN3, {&MODULE_P21, 6}, Ifx_RxSel_f};
IfxAsclin_Rx_In IfxAsclin3_RXG_P21_2_IN = {&MODULE_ASCLIN3, {&MODULE_P21, 2}, Ifx_RxSel_g};
IfxAsclin_Rx_In IfxAsclin3_RXG_P21_3_IN = {&MODULE_ASCLIN3, {&MODULE_P21, 3}, Ifx_RxSel_g};
IfxAsclin_Rx_In IfxAsclin3_RXH_P13_12_IN = {&MODULE_ASCLIN3, {&MODULE_P13,12}, Ifx_RxSel_h};
IfxAsclin_Rx_In IfxAsclin4_RXA_P00_12_IN = {&MODULE_ASCLIN4, {&MODULE_P00,12}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin4_RXB_P34_2_IN = {&MODULE_ASCLIN4, {&MODULE_P34, 2}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin4_RXC_P22_6_IN = {&MODULE_ASCLIN4, {&MODULE_P22, 6}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin4_RXD_P22_9_IN = {&MODULE_ASCLIN4, {&MODULE_P22, 9}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin5_RXA_P00_6_IN = {&MODULE_ASCLIN5, {&MODULE_P00, 6}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin5_RXB_P33_4_IN = {&MODULE_ASCLIN5, {&MODULE_P33, 4}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin5_RXC_P22_3_IN = {&MODULE_ASCLIN5, {&MODULE_P22, 3}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin5_RXD_P14_15_IN = {&MODULE_ASCLIN5, {&MODULE_P14,15}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin6_RXA_P23_3_IN = {&MODULE_ASCLIN6, {&MODULE_P23, 3}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin6_RXB_P01_0_IN = {&MODULE_ASCLIN6, {&MODULE_P01, 0}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin6_RXC_P32_6_IN = {&MODULE_ASCLIN6, {&MODULE_P32, 6}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin6_RXD_P10_9_IN = {&MODULE_ASCLIN6, {&MODULE_P10, 9}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin6_RXE_P22_0_IN = {&MODULE_ASCLIN6, {&MODULE_P22, 0}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin6_RXF_P23_1_IN = {&MODULE_ASCLIN6, {&MODULE_P23, 1}, Ifx_RxSel_f};
IfxAsclin_Rx_In IfxAsclin7_RXA_P14_15_IN = {&MODULE_ASCLIN7, {&MODULE_P14,15}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin7_RXB_P01_8_IN = {&MODULE_ASCLIN7, {&MODULE_P01, 8}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin7_RXC_P23_2_IN = {&MODULE_ASCLIN7, {&MODULE_P23, 2}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin7_RXD_P13_11_IN = {&MODULE_ASCLIN7, {&MODULE_P13,11}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin7_RXE_P22_1_IN = {&MODULE_ASCLIN7, {&MODULE_P22, 1}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin7_RXF_P22_4_IN = {&MODULE_ASCLIN7, {&MODULE_P22, 4}, Ifx_RxSel_f};
IfxAsclin_Rx_In IfxAsclin8_RXA_P02_9_IN = {&MODULE_ASCLIN8, {&MODULE_P02, 9}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin8_RXB_P02_10_IN = {&MODULE_ASCLIN8, {&MODULE_P02,10}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin8_RXC_P33_1_IN = {&MODULE_ASCLIN8, {&MODULE_P33, 1}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin8_RXD_P33_6_IN = {&MODULE_ASCLIN8, {&MODULE_P33, 6}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin8_RXE_P34_5_IN = {&MODULE_ASCLIN8, {&MODULE_P34, 5}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin9_RXA_P01_5_IN = {&MODULE_ASCLIN9, {&MODULE_P01, 5}, Ifx_RxSel_a};
IfxAsclin_Rx_In IfxAsclin9_RXB_P01_7_IN = {&MODULE_ASCLIN9, {&MODULE_P01, 7}, Ifx_RxSel_b};
IfxAsclin_Rx_In IfxAsclin9_RXC_P14_7_IN = {&MODULE_ASCLIN9, {&MODULE_P14, 7}, Ifx_RxSel_c};
IfxAsclin_Rx_In IfxAsclin9_RXD_P14_9_IN = {&MODULE_ASCLIN9, {&MODULE_P14, 9}, Ifx_RxSel_d};
IfxAsclin_Rx_In IfxAsclin9_RXE_P20_6_IN = {&MODULE_ASCLIN9, {&MODULE_P20, 6}, Ifx_RxSel_e};
IfxAsclin_Rx_In IfxAsclin9_RXF_P20_7_IN = {&MODULE_ASCLIN9, {&MODULE_P20, 7}, Ifx_RxSel_f};
IfxAsclin_Sclk_Out IfxAsclin0_SCLK_P14_0_OUT = {&MODULE_ASCLIN0, {&MODULE_P14, 0}, IfxPort_OutputIdx_alt6};
IfxAsclin_Sclk_Out IfxAsclin0_SCLK_P15_2_OUT = {&MODULE_ASCLIN0, {&MODULE_P15, 2}, IfxPort_OutputIdx_alt6};
IfxAsclin_Sclk_Out IfxAsclin10_SCLK_P13_2_OUT = {&MODULE_ASCLIN10, {&MODULE_P13, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin11_SCLK_P21_3_OUT = {&MODULE_ASCLIN11, {&MODULE_P21, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin1_SCLK_P15_0_OUT = {&MODULE_ASCLIN1, {&MODULE_P15, 0}, IfxPort_OutputIdx_alt6};
IfxAsclin_Sclk_Out IfxAsclin1_SCLK_P20_10_OUT = {&MODULE_ASCLIN1, {&MODULE_P20,10}, IfxPort_OutputIdx_alt6};
IfxAsclin_Sclk_Out IfxAsclin1_SCLK_P33_11_OUT = {&MODULE_ASCLIN1, {&MODULE_P33,11}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin1_SCLK_P33_12_OUT = {&MODULE_ASCLIN1, {&MODULE_P33,12}, IfxPort_OutputIdx_alt4};
IfxAsclin_Sclk_Out IfxAsclin2_SCLK_P02_4_OUT = {&MODULE_ASCLIN2, {&MODULE_P02, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin2_SCLK_P10_6_OUT = {&MODULE_ASCLIN2, {&MODULE_P10, 6}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin2_SCLK_P14_2_OUT = {&MODULE_ASCLIN2, {&MODULE_P14, 2}, IfxPort_OutputIdx_alt6};
IfxAsclin_Sclk_Out IfxAsclin2_SCLK_P33_7_OUT = {&MODULE_ASCLIN2, {&MODULE_P33, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin2_SCLK_P33_9_OUT = {&MODULE_ASCLIN2, {&MODULE_P33, 9}, IfxPort_OutputIdx_alt4};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P00_0_OUT = {&MODULE_ASCLIN3, {&MODULE_P00, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P00_2_OUT = {&MODULE_ASCLIN3, {&MODULE_P00, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P11_1_OUT = {&MODULE_ASCLIN3, {&MODULE_P11, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P11_4_OUT = {&MODULE_ASCLIN3, {&MODULE_P11, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P15_6_OUT = {&MODULE_ASCLIN3, {&MODULE_P15, 6}, IfxPort_OutputIdx_alt6};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P15_8_OUT = {&MODULE_ASCLIN3, {&MODULE_P15, 8}, IfxPort_OutputIdx_alt6};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P20_0_OUT = {&MODULE_ASCLIN3, {&MODULE_P20, 0}, IfxPort_OutputIdx_alt3};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P21_5_OUT = {&MODULE_ASCLIN3, {&MODULE_P21, 5}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P21_7_OUT = {&MODULE_ASCLIN3, {&MODULE_P21, 7}, IfxPort_OutputIdx_alt3};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P32_3_OUT = {&MODULE_ASCLIN3, {&MODULE_P32, 3}, IfxPort_OutputIdx_alt4};
IfxAsclin_Sclk_Out IfxAsclin3_SCLK_P33_2_OUT = {&MODULE_ASCLIN3, {&MODULE_P33, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin4_SCLK_P00_10_OUT = {&MODULE_ASCLIN4, {&MODULE_P00,10}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin4_SCLK_P22_7_OUT = {&MODULE_ASCLIN4, {&MODULE_P22, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin4_SCLK_P34_3_OUT = {&MODULE_ASCLIN4, {&MODULE_P34, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin5_SCLK_P14_12_OUT = {&MODULE_ASCLIN5, {&MODULE_P14,12}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin5_SCLK_P22_8_OUT = {&MODULE_ASCLIN5, {&MODULE_P22, 8}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin5_SCLK_P33_3_OUT = {&MODULE_ASCLIN5, {&MODULE_P33, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin6_SCLK_P02_14_OUT = {&MODULE_ASCLIN6, {&MODULE_P02,14}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin6_SCLK_P10_11_OUT = {&MODULE_ASCLIN6, {&MODULE_P10,11}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin6_SCLK_P23_1_OUT = {&MODULE_ASCLIN6, {&MODULE_P23, 1}, IfxPort_OutputIdx_alt7};
IfxAsclin_Sclk_Out IfxAsclin7_SCLK_P01_10_OUT = {&MODULE_ASCLIN7, {&MODULE_P01,10}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin7_SCLK_P13_13_OUT = {&MODULE_ASCLIN7, {&MODULE_P13,13}, IfxPort_OutputIdx_alt2};
IfxAsclin_Sclk_Out IfxAsclin7_SCLK_P14_12_OUT = {&MODULE_ASCLIN7, {&MODULE_P14,12}, IfxPort_OutputIdx_alt3};
IfxAsclin_Sclk_Out IfxAsclin8_SCLK_P02_8_OUT = {&MODULE_ASCLIN8, {&MODULE_P02, 8}, IfxPort_OutputIdx_alt3};
IfxAsclin_Sclk_Out IfxAsclin9_SCLK_P01_6_OUT = {&MODULE_ASCLIN9, {&MODULE_P01, 6}, IfxPort_OutputIdx_alt3};
IfxAsclin_Slso_Out IfxAsclin10_SLSO_P13_3_OUT = {&MODULE_ASCLIN10, {&MODULE_P13, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin11_SLSO_P21_4_OUT = {&MODULE_ASCLIN11, {&MODULE_P21, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin1_SLSO_P14_3_OUT = {&MODULE_ASCLIN1, {&MODULE_P14, 3}, IfxPort_OutputIdx_alt4};
IfxAsclin_Slso_Out IfxAsclin1_SLSO_P20_8_OUT = {&MODULE_ASCLIN1, {&MODULE_P20, 8}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin1_SLSO_P33_10_OUT = {&MODULE_ASCLIN1, {&MODULE_P33,10}, IfxPort_OutputIdx_alt4};
IfxAsclin_Slso_Out IfxAsclin2_SLSO_P02_3_OUT = {&MODULE_ASCLIN2, {&MODULE_P02, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin2_SLSO_P10_5_OUT = {&MODULE_ASCLIN2, {&MODULE_P10, 5}, IfxPort_OutputIdx_alt6};
IfxAsclin_Slso_Out IfxAsclin2_SLSO_P33_6_OUT = {&MODULE_ASCLIN2, {&MODULE_P33, 6}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin3_SLSO_P00_3_OUT = {&MODULE_ASCLIN3, {&MODULE_P00, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin3_SLSO_P12_1_OUT = {&MODULE_ASCLIN3, {&MODULE_P12, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin3_SLSO_P14_3_OUT = {&MODULE_ASCLIN3, {&MODULE_P14, 3}, IfxPort_OutputIdx_alt5};
IfxAsclin_Slso_Out IfxAsclin3_SLSO_P21_2_OUT = {&MODULE_ASCLIN3, {&MODULE_P21, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin3_SLSO_P21_6_OUT = {&MODULE_ASCLIN3, {&MODULE_P21, 6}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin3_SLSO_P33_1_OUT = {&MODULE_ASCLIN3, {&MODULE_P33, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin4_SLSO_P00_11_OUT = {&MODULE_ASCLIN4, {&MODULE_P00,11}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin4_SLSO_P22_11_OUT = {&MODULE_ASCLIN4, {&MODULE_P22,11}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin4_SLSO_P22_4_OUT = {&MODULE_ASCLIN4, {&MODULE_P22, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin4_SLSO_P34_4_OUT = {&MODULE_ASCLIN4, {&MODULE_P34, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin5_SLSO_P14_8_OUT = {&MODULE_ASCLIN5, {&MODULE_P14, 8}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin5_SLSO_P33_5_OUT = {&MODULE_ASCLIN5, {&MODULE_P33, 5}, IfxPort_OutputIdx_alt7};
IfxAsclin_Slso_Out IfxAsclin6_SLSO_P02_12_OUT = {&MODULE_ASCLIN6, {&MODULE_P02,12}, IfxPort_OutputIdx_alt4};
IfxAsclin_Slso_Out IfxAsclin6_SLSO_P10_13_OUT = {&MODULE_ASCLIN6, {&MODULE_P10,13}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin6_SLSO_P23_4_OUT = {&MODULE_ASCLIN6, {&MODULE_P23, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin7_SLSO_P01_11_OUT = {&MODULE_ASCLIN7, {&MODULE_P01,11}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin7_SLSO_P13_15_OUT = {&MODULE_ASCLIN7, {&MODULE_P13,15}, IfxPort_OutputIdx_alt2};
IfxAsclin_Slso_Out IfxAsclin7_SLSO_P14_8_OUT = {&MODULE_ASCLIN7, {&MODULE_P14, 8}, IfxPort_OutputIdx_alt3};
IfxAsclin_Slso_Out IfxAsclin8_SLSO_P02_11_OUT = {&MODULE_ASCLIN8, {&MODULE_P02,11}, IfxPort_OutputIdx_alt3};
IfxAsclin_Slso_Out IfxAsclin9_SLSO_P01_4_OUT = {&MODULE_ASCLIN9, {&MODULE_P01, 4}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin0_TX_P01_13_OUT = {&MODULE_ASCLIN0, {&MODULE_P01,13}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin0_TX_P13_10_OUT = {&MODULE_ASCLIN0, {&MODULE_P13,10}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin0_TX_P14_0_OUT = {&MODULE_ASCLIN0, {&MODULE_P14, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin0_TX_P14_1_OUT = {&MODULE_ASCLIN0, {&MODULE_P14, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin0_TX_P15_2_OUT = {&MODULE_ASCLIN0, {&MODULE_P15, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin0_TX_P15_3_OUT = {&MODULE_ASCLIN0, {&MODULE_P15, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin0_TX_P33_9_OUT = {&MODULE_ASCLIN0, {&MODULE_P33, 9}, IfxPort_OutputIdx_alt6};
IfxAsclin_Tx_Out IfxAsclin10_TX_P00_8_OUT = {&MODULE_ASCLIN10, {&MODULE_P00, 8}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin10_TX_P13_0_OUT = {&MODULE_ASCLIN10, {&MODULE_P13, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin11_TX_P10_0_OUT = {&MODULE_ASCLIN11, {&MODULE_P10, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin11_TX_P21_0_OUT = {&MODULE_ASCLIN11, {&MODULE_P21, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin11_TX_P21_5_OUT = {&MODULE_ASCLIN11, {&MODULE_P21, 5}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin12_TX_P00_3_OUT = {&MODULE_ASCLIN12, {&MODULE_P00, 3}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin12_TX_P01_6_OUT = {&MODULE_ASCLIN12, {&MODULE_P01, 6}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin13_TX_P00_10_OUT = {&MODULE_ASCLIN13, {&MODULE_P00,10}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin13_TX_P00_11_OUT = {&MODULE_ASCLIN13, {&MODULE_P00,11}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin14_TX_P33_2_OUT = {&MODULE_ASCLIN14, {&MODULE_P33, 2}, IfxPort_OutputIdx_alt7};
IfxAsclin_Tx_Out IfxAsclin14_TX_P33_3_OUT = {&MODULE_ASCLIN14, {&MODULE_P33, 3}, IfxPort_OutputIdx_alt7};
IfxAsclin_Tx_Out IfxAsclin15_TX_P32_7_OUT = {&MODULE_ASCLIN15, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin15_TX_P33_0_OUT = {&MODULE_ASCLIN15, {&MODULE_P33, 0}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin16_TX_P23_6_OUT = {&MODULE_ASCLIN16, {&MODULE_P23, 6}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin16_TX_P23_7_OUT = {&MODULE_ASCLIN16, {&MODULE_P23, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin17_TX_P22_11_OUT = {&MODULE_ASCLIN17, {&MODULE_P22,11}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin17_TX_P22_7_OUT = {&MODULE_ASCLIN17, {&MODULE_P22, 7}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin18_TX_P21_3_OUT = {&MODULE_ASCLIN18, {&MODULE_P21, 3}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin18_TX_P21_4_OUT = {&MODULE_ASCLIN18, {&MODULE_P21, 4}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin19_TX_P15_4_OUT = {&MODULE_ASCLIN19, {&MODULE_P15, 4}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin19_TX_P15_7_OUT = {&MODULE_ASCLIN19, {&MODULE_P15, 7}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin1_TX_P02_2_OUT = {&MODULE_ASCLIN1, {&MODULE_P02, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P11_12_OUT = {&MODULE_ASCLIN1, {&MODULE_P11,12}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P14_10_OUT = {&MODULE_ASCLIN1, {&MODULE_P14,10}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin1_TX_P14_15_OUT = {&MODULE_ASCLIN1, {&MODULE_P14,15}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P15_0_OUT = {&MODULE_ASCLIN1, {&MODULE_P15, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P15_1_OUT = {&MODULE_ASCLIN1, {&MODULE_P15, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P15_4_OUT = {&MODULE_ASCLIN1, {&MODULE_P15, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P15_5_OUT = {&MODULE_ASCLIN1, {&MODULE_P15, 5}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P20_10_OUT = {&MODULE_ASCLIN1, {&MODULE_P20,10}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P33_12_OUT = {&MODULE_ASCLIN1, {&MODULE_P33,12}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin1_TX_P33_13_OUT = {&MODULE_ASCLIN1, {&MODULE_P33,13}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin20_TX_P14_7_OUT = {&MODULE_ASCLIN20, {&MODULE_P14, 7}, IfxPort_OutputIdx_alt7};
IfxAsclin_Tx_Out IfxAsclin20_TX_P14_8_OUT = {&MODULE_ASCLIN20, {&MODULE_P14, 8}, IfxPort_OutputIdx_alt7};
IfxAsclin_Tx_Out IfxAsclin21_TX_P13_2_OUT = {&MODULE_ASCLIN21, {&MODULE_P13, 2}, IfxPort_OutputIdx_alt7};
IfxAsclin_Tx_Out IfxAsclin21_TX_P13_3_OUT = {&MODULE_ASCLIN21, {&MODULE_P13, 3}, IfxPort_OutputIdx_alt6};
IfxAsclin_Tx_Out IfxAsclin22_TX_P10_0_OUT = {&MODULE_ASCLIN22, {&MODULE_P10, 0}, IfxPort_OutputIdx_alt6};
