Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC38x/IfxAsclin_PinMap_TC38x_516.c
IfxAsclin_Tx_Out IfxAsclin22_TX_P10_4_OUT = {&MODULE_ASCLIN22, {&MODULE_P10, 4}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin23_TX_P10_7_OUT = {&MODULE_ASCLIN23, {&MODULE_P10, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin23_TX_P10_8_OUT = {&MODULE_ASCLIN23, {&MODULE_P10, 8}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin2_TX_P02_0_OUT = {&MODULE_ASCLIN2, {&MODULE_P02, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin2_TX_P02_9_OUT = {&MODULE_ASCLIN2, {&MODULE_P02, 9}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin2_TX_P10_5_OUT = {&MODULE_ASCLIN2, {&MODULE_P10, 5}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin2_TX_P14_2_OUT = {&MODULE_ASCLIN2, {&MODULE_P14, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin2_TX_P14_3_OUT = {&MODULE_ASCLIN2, {&MODULE_P14, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin2_TX_P32_5_OUT = {&MODULE_ASCLIN2, {&MODULE_P32, 5}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin2_TX_P33_8_OUT = {&MODULE_ASCLIN2, {&MODULE_P33, 8}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin2_TX_P33_9_OUT = {&MODULE_ASCLIN2, {&MODULE_P33, 9}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P00_0_OUT = {&MODULE_ASCLIN3, {&MODULE_P00, 0}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin3_TX_P00_1_OUT = {&MODULE_ASCLIN3, {&MODULE_P00, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P11_0_OUT = {&MODULE_ASCLIN3, {&MODULE_P11, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P11_1_OUT = {&MODULE_ASCLIN3, {&MODULE_P11, 1}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin3_TX_P13_9_OUT = {&MODULE_ASCLIN3, {&MODULE_P13, 9}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P15_6_OUT = {&MODULE_ASCLIN3, {&MODULE_P15, 6}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P15_7_OUT = {&MODULE_ASCLIN3, {&MODULE_P15, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P20_0_OUT = {&MODULE_ASCLIN3, {&MODULE_P20, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P20_3_OUT = {&MODULE_ASCLIN3, {&MODULE_P20, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P21_7_OUT = {&MODULE_ASCLIN3, {&MODULE_P21, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P22_0_OUT = {&MODULE_ASCLIN3, {&MODULE_P22, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P22_1_OUT = {&MODULE_ASCLIN3, {&MODULE_P22, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P32_2_OUT = {&MODULE_ASCLIN3, {&MODULE_P32, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin3_TX_P32_3_OUT = {&MODULE_ASCLIN3, {&MODULE_P32, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin4_TX_P00_9_OUT = {&MODULE_ASCLIN4, {&MODULE_P00, 9}, IfxPort_OutputIdx_alt5};
IfxAsclin_Tx_Out IfxAsclin4_TX_P22_10_OUT = {&MODULE_ASCLIN4, {&MODULE_P22,10}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin4_TX_P22_5_OUT = {&MODULE_ASCLIN4, {&MODULE_P22, 5}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin4_TX_P34_1_OUT = {&MODULE_ASCLIN4, {&MODULE_P34, 1}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin5_TX_P00_7_OUT = {&MODULE_ASCLIN5, {&MODULE_P00, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin5_TX_P14_14_OUT = {&MODULE_ASCLIN5, {&MODULE_P14,14}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin5_TX_P22_2_OUT = {&MODULE_ASCLIN5, {&MODULE_P22, 2}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin5_TX_P33_0_OUT = {&MODULE_ASCLIN5, {&MODULE_P33, 0}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin6_TX_P01_1_OUT = {&MODULE_ASCLIN6, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin6_TX_P02_15_OUT = {&MODULE_ASCLIN6, {&MODULE_P02,15}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin6_TX_P10_10_OUT = {&MODULE_ASCLIN6, {&MODULE_P10,10}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin6_TX_P22_0_OUT = {&MODULE_ASCLIN6, {&MODULE_P22, 0}, IfxPort_OutputIdx_alt7};
IfxAsclin_Tx_Out IfxAsclin6_TX_P23_5_OUT = {&MODULE_ASCLIN6, {&MODULE_P23, 5}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin6_TX_P32_7_OUT = {&MODULE_ASCLIN6, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin7_TX_P01_12_OUT = {&MODULE_ASCLIN7, {&MODULE_P01,12}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin7_TX_P01_9_OUT = {&MODULE_ASCLIN7, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin7_TX_P13_12_OUT = {&MODULE_ASCLIN7, {&MODULE_P13,12}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin7_TX_P14_14_OUT = {&MODULE_ASCLIN7, {&MODULE_P14,14}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin7_TX_P22_1_OUT = {&MODULE_ASCLIN7, {&MODULE_P22, 1}, IfxPort_OutputIdx_alt7};
IfxAsclin_Tx_Out IfxAsclin7_TX_P23_3_OUT = {&MODULE_ASCLIN7, {&MODULE_P23, 3}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin8_TX_P02_9_OUT = {&MODULE_ASCLIN8, {&MODULE_P02, 9}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin8_TX_P33_7_OUT = {&MODULE_ASCLIN8, {&MODULE_P33, 7}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin8_TX_P34_5_OUT = {&MODULE_ASCLIN8, {&MODULE_P34, 5}, IfxPort_OutputIdx_alt2};
IfxAsclin_Tx_Out IfxAsclin9_TX_P01_7_OUT = {&MODULE_ASCLIN9, {&MODULE_P01, 7}, IfxPort_OutputIdx_alt3};
IfxAsclin_Tx_Out IfxAsclin9_TX_P14_7_OUT = {&MODULE_ASCLIN9, {&MODULE_P14, 7}, IfxPort_OutputIdx_alt4};
IfxAsclin_Tx_Out IfxAsclin9_TX_P20_7_OUT = {&MODULE_ASCLIN9, {&MODULE_P20, 7}, IfxPort_OutputIdx_alt2};


const IfxAsclin_Cts_In *IfxAsclin_Cts_In_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_CTS_IN_NUM_ITEMS] = {
    {
        &IfxAsclin0_CTSA_P14_9_IN,
        NULL_PTR
    },
    {
        &IfxAsclin1_CTSA_P20_7_IN,
        &IfxAsclin1_CTSB_P32_4_IN
    },
    {
        &IfxAsclin2_CTSA_P10_7_IN,
        &IfxAsclin2_CTSB_P33_5_IN
    },
    {
        &IfxAsclin3_CTSA_P00_12_IN,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    }
};

const IfxAsclin_Rts_Out *IfxAsclin_Rts_Out_pinTable[IFXASCLIN_PINMAP_NUM_MODULES][IFXASCLIN_PINMAP_RTS_OUT_NUM_ITEMS] = {
    {
        &IfxAsclin0_RTS_P14_7_OUT,
        NULL_PTR
    },
    {
        &IfxAsclin1_RTS_P20_6_OUT,
        &IfxAsclin1_RTS_P23_1_OUT
    },
    {
        &IfxAsclin2_RTS_P10_8_OUT,
        &IfxAsclin2_RTS_P33_4_OUT
    },
    {
        &IfxAsclin3_RTS_P00_9_OUT,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    },
    {
        NULL_PTR,
        NULL_PTR
    }
};

